package com.priva.tango.designmodle;

/**
 * @description
 * @date 2022/9/23 11:27
 */
public class ModelMain {
    public static void main(String[] args) {
        /**
         * 具有状态的模式：
         * 1.单例，初始化前后有状态（空/非空）
         * 2.状态模式，内部通过状态选择行为
         * 3.享元模式，集合中数据有使用或空闲状态
         * 4.备忘录模式，上一步的状态会被备份
         *
         * 为了共享：单例，享元
         */

        /**
         * 单体对象增强
         * 1.装饰器
         * 2.代理
         * 3.继承
         */
        /**
         * 简化流程：
         * 1.外观
         */
        /**
         * 管理集合：
         * 1.迭代，提供多种遍历方式
         * 2.中介者，协调参与者
         * 3.备忘录，管理同一个对象的不同状态集合
         * 4.责任链，可能会管理集合来处理流程
         * 5.观察者，通知对象集合
         * 6.享元，池化对象集合
         */
        /**
         * 处理对象间关系
         * 1）组合
         * 2）装饰器，代理，对象替代另一个进行增强
         * 3）适配器，调整其中一个对象偏向另一个对象
         */

    }
}
