package com.priva.tango.exam;

public class ExamMain {
    /**
     * 过程模型
     *  瀑布  sdlc  从需求，软件设计，开发设计，编码实现，单元测试，集成测试，系统测试到运行维护
     *  V模型
     *  原型模型
     *  螺旋模型  原型+瀑布  每个阶段目标分析，  风险分析   ，开发验证，评审
     *  构建组装模型  cbse
     *  快速应用开发  rad 瀑布+构建
     *  统一过程/开发方法  用例驱动，架构中心，迭代增量 （迭代：新增或优化  增量：新增）
     *          四大过程/阶段：初始，细化，构造，移交
     *         核心工作流： 业务建模，需求，分析设计，实现，测试，部署，配置与变更管理，项目管理，环境
     *  敏捷开发    适应性，以人为本，增量迭代，小型项目
     *         价值观 极限编程 XP  接近螺旋开发：
     *          加强面对面沟通，减少文档
     *          简单不过度设计，替换代价小
     *          及时反馈
     *          勇气，对变更说yes
     *         水晶方法：机动性的方法，不同项目不同敏捷方式
     *         SCRUM：  敏捷过程，偏项目管理
     *         特征驱动开发 FDD：开发三要素 （人，过程，技术）
     *                  关键角色：PM，CTO，开发经理，主程序，程序，领域专家
     *
     *
     */
}
