package com.priva.tango.exam;

/**
 * 信息化
 */
public class Informationlize {
    /**
     * 信息和信息化的概念。信息不同于普通的事物,它具有抽象性和客观性,可以减少不确定性。
     * 信息化是工业社会向信息社会的演进和变革需要掌握信息化基本思想和理念。
     * 信息化能够推动组织结构创新、管理创新,提升组织效率和推动变革性质事情的发生。
     *
     * ISA  信息化架构是对特定信息的统筹规划设计安排
     *
     * >>信息化架构模式：
     *      数据导向架构: 关注数据模型和数据质量。研究数据对象、数据对象之间的关系，数据的产生、变更、废弃等数据生命周期;
     *                      数据管理。在数据中心、BI商业智能建设中使用较多。
     *      流程导向架构: 关注流程，目的是为了端到端流程整合，以及架构对流程变化的适应度。SOA本身就是关键方法和技术。
     *                      研究切入点是价值链分析、业务流程分析和分解、业务组件划分。
     *  >> 价值驱动
     *          价值期望值、反作用力、变革催化剂
     *
     * 第一阶段
     * 以数据处理为核心围绕职能部门需求
     * >> 信息化工程总体规划的方法论
         *  企业系统规划法 (BSP)
         *  关键成功因素法(CSF)
         *  战略集合转化法 (SST)
     * 第二阶段
     * 以企业内部MIS为核心
     * 围绕企业整体需求
     * 战略数据规划法(SDP) 信息工程法(IE)战略格法 (SG)
     * 第三阶段
     * 综合考虑企业内外环境以集成为核心，围绕企业战略需求
     * 价值链分析法(VCA)、战略一致性模型(SAM)
     *
     *>>>企业应用集成
     * 业务过程的集成      实现不同应用系统中的流程能够无缝连接
     * 应用系统的集成     实现不同应用系统之间能够实现数据和方法的共享
     * 数据的集成        实现不同系统的数据交流与共享
     * 技术平台的集成      软件/硬件/网络层面的集成
     *
     * >>集成支持的方式
     * 面向信息的集成:针对信息孤岛，解决企业内数据共享问题
     * 面向过程的集成:采用工作流管理方式可以对业务过程逻辑和应用逻辑进行分离，实现过程建模和数据、功能的分离。
     * 面向服务的集成:面向服务的集成可以较好地实现(企业间)具有松散合关系的不同应用间的互操作.
     *
     * 企业信息门户(EIP，Enterpriselnformation Portal):使员工/合作伙伴/客户/供应商都能够访问企业内部网络和因特网存储的
     * 各种自己所需的信息。
     * 》企业知识门户(EKP，Enterprise Knowledge Portal):企业网站的基础上增加知识性内容。
     * 企业应用门户(EAP，EnterpriseApplication Portal):以商业流程和企业应用为核心，把商业流程中功能不同的应用模块通
     * 过门户技术集成在一起。
     * 垂直门户:为某一特定的行业服务的，传送的信息只属于人们感兴趣的领域。
     *
     *
     * >> 电子政务
     *  电子政务主要有3类角色:政府(Government)，企(事) 业单位 (Business) 及公民(Citizen) 。如果有第4类就是公务员(Employee)。
     *  电子商务主要有2类角色: 企业 (Business) 及个人 (Customer
     */
}
