package com.priva.tango.exam;

/**
 * 项目管理
 * @author tango
 * @description
 * @date 2023/10/23 10:18
 */
public class Manage {
    /*项目管理发展历史*/
    /**
     * 人治，专业人才的经验，不够系统
     * 依靠工具和方法，成立专业组织
     * 80年代开始推出规范
     */
    /**
     * 软件项目里的金三角：时间（多久可以完成）、成本（花多少钱）、范围（需要实现多少功能）
     *
     * 软件项目管理主要内容  进度、配置、质量和风险管理
     *      人员的组织与管理，软件度量，软件项目计划，风险管理，软件质量保证，软件过程能力评估，软件配置管理等
     */
    /*时间管理*/
    /**
     *  活动定义、活动排序、活动的资源估算、活动历时估算（专家判断法，三点估算法，功能点估算法，自上而下估算）、制定计划（估算抉择）和进度控制（优先级，是否增加资源）
     */
    /*进度管理*/
    /**
     *
     */
    /*配置管理 SCM*/
    /**
     * 配置项  基线配置项（可交付成果），非基线配置（计划报告）
     * 配置库  开发库（变动中），受控库（稳定库，是管理~~~基线~~~），产品库（最终产品）
     * >>定义
     * 软件配置管理(SCM)是指通过执行版本控制、变更控制的规程，以及使用合适的配置管理软件，来保证所有配置项的完整性和可跟踪性。配置管理是对工作成果的一种有效保护
     * >> 目标
     * 软件配置管理是在贯穿整个软件生命周期中建立和维护项目产品的完整性。它的基本目标包括：
     * 目标 1: 软件配置管理的各项工作是有计划进行的。
     * 目标 2: 被选择的项目产品得到识别，控制并且可以被相关人员获取。
     * 目标 3: 已识别出的项目产品的更改得到控制。
     * 目标 4: 使相关组别和个人及时了解软件基准的状态和内容。
     * >>活动
     *  配置项识别、配置项的标识和控制、工作空间管理、【版本控制、变更控制】、状态报告、配置审计
     *
     *  核心内容 版本控制、变更控制
     *  >>软件生命周期
     *      1.可行性分析与项目开发计划
     *      2.需求分析    产出数据量图
     *      3.概要设计    产出模块结构图,层次图，HIPO图(层次图+输入输出关系图)
     *      4.详细设计    产出程序流程图，伪代码，盒图（N-S图）
     *      5.编码，6.测试，维护
     */
    /*软件质量管理*/
    /**
     * 质量保证QA   质量审计和过程分析
     * 质量控制QC   看结果
     *
     * >>质量认证标准
     * ISO 9001
     * CMMI 软件过程改进 是一个体系，控制整个过程
     *      分为五级，是对企业管理的认证
     */
    /*软件风险管理*/
    /**
     * >> 目标
     *  在项目管理软件中进行风险管理，从而降低风险，保障项目的成功完成
     *
     *>>方法
     * 风险管理是一个系统性的过程，需要经过以下几个步骤
     * 1、风险识别：识别和列出可能出现的风险。
     * 2、风险分析：分析每个风险的概率、影响力和优先级。
     * 3、风险评估：确定每个风险的严重程度和应对方案。
     * 4、风险应对：制定和实施风险应对方案。
     * 5、风险监控：监控风险应对方案的执行效果，及时进行调整和优化。
     *
     * >> Boehm体系
     *  Boehm思想的核心是10大风险因素（包括人员短缺、不合理的进度安排和预算、不断的需求变动等），风险评估（识别、分析、设置优先级）和风险控制（制定管理计划、解决和监督风险）两大部分组成
     *  估计+控制
     * >> Charette
     *  美国Charette的风险分析和管理体系，把风险分成分析（辨识、估计、评价）和管理（计划、控制、监督）两大阶段。偏重理论
     *  分析+管理
     */
}
